Catalogs/Сотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Сотрудник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ОкноАвторизации/Ext/Form/Module.bsl
&НаКлиенте
Процедура Авторизация(Команда)
	МассивПользователя = Новый Массив;
	МассивПользователя = ВыборкаПользователей();
	Параметр = Новый Структура("Логин",Логин);
	Если Логин = МассивПользователя[0] И Пароль = МассивПользователя[1] Тогда
		Если МассивПользователя[2] = Истина Тогда
			ОткрытьФорму("ОбщаяФорма.МенюАдмина",Параметр);
		ИначеЕсли МассивПользователя[2] = Ложь Тогда
			ОткрытьФорму("ОбщаяФорма.МенюСотрудника",Параметр);
		КонецЕсли;
	КонецЕсли;
	Логин = "";
	Пароль = "";
КонецПроцедуры

&НаСервере
Функция ВыборкаПользователей()
Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин);
	ВыборкаЛогина = Пользователь.Логин;
	ВыборкаПароль = Пользователь.Пароль;
	ВыборкаРоли = Пользователь.Роль;
	Массив = Новый Массив;
	Массив.Вставить(0,ВыборкаЛогина);
	Массив.Вставить(1,ВыборкаПароль);
	Массив.Вставить(2,ВыборкаРоли);
	Возврат Массив; 	
КонецФункции

&НаКлиенте
Процедура ВводДанных(Команда)
	Параметр1 = Новый Структура("Логин",Логин);
	ОткрытьФорму("Документ.ДобавлениеДанныхГражданином.Форма.ФормаДобавленияДанныхГражданином",Параметр1);
КонецПроцедуры
